{
  "metadata": {
    "id": "bank-balance-cld",
    "title": "Interest-Earning Bank Account Compound Growth",
    "archetype": "limits-to-growth",
    "description": "A simple causal loop diagram showing how bank account balances grow through compound interest, where interest earned increases the balance, which in turn generates more interest in a reinforcing cycle.",
    "learning_objectives": [
      "Understand the concept of compound interest as a reinforcing feedback loop",
      "Recognize how small initial differences compound over time",
      "Identify the exponential growth pattern created by positive feedback",
      "Connect mathematical concepts to systems thinking principles"
    ],
    "version": "1.0.0",
    "created_date": "2025-01-18T00:00:00Z",
    "updated_date": "2025-01-18T00:00:00Z",
    "author": "Systems Thinking Educational Team",
    "tags": ["finance", "compound-interest", "exponential-growth", "reinforcing-loop", "banking"],
    "notes": "Node and Arc Placement Strategy: This CLD uses a simple horizontal layout optimized for clockwise flow visualization. Bank Balance is positioned at the left (100, 200) as the primary stock/accumulator, while Interest Earned is positioned at the right (300, 200) as the flow variable. The 200-unit horizontal separation provides clear visual distinction while maintaining readability. The clockwise flow moves from Bank Balance (left) → Interest Earned (right) → back to Bank Balance, creating an intuitive reading pattern that matches the temporal sequence: existing balance generates interest, then interest increases balance. The reinforcing loop symbol is positioned centrally at (200, 200) to be equidistant from both nodes. This horizontal alignment emphasizes the cyclical nature while being space-efficient and avoiding edge crossings. The coordinate system assumes a 300x300 canvas with nodes positioned in the center vertical axis to allow for future expansion horizontally if additional factors (fees, deposits, withdrawals) were added to the model."
  },
  "nodes": [
    {
      "id": "bank_balance",
      "label": "Bank Balance",
      "position": {"x": 100, "y": 100},
      "type": "stock",
      "description": "The total amount of money accumulated in the savings account, including principal and all previously earned interest",
      "examples": ["$10,000 in savings account", "$25,750 after 5 years of growth", "Current account statement balance"],
      "measurement": "Dollar amount, account balance statements, real-time banking app display"
    },
    {
      "id": "interest_earned",
      "label": "Interest Earned",
      "position": {"x": 500, "y": 100},
      "type": "variable",
      "description": "The periodic interest income generated by the account balance, calculated as a percentage of the current balance",
      "examples": ["$200 annual interest on $10,000 at 2% APY", "$52.50 quarterly payment", "Monthly interest deposit"],
      "measurement": "Dollar amount per period, annual percentage yield calculations, interest payment records"
    }
  ],
  "edges": [
    {
      "id": "balance_generates_interest",
      "source": "bank_balance",
      "target": "interest_earned",
      "polarity": "positive",
      "label": "generates",
      "description": "Higher bank balance generates proportionally more interest income based on the account's interest rate",
      "strength": "strong",
      "evidence": [
        "Standard banking practice: interest = balance × rate × time",
        "APY calculations show direct proportional relationship",
        "Federal banking regulations require interest calculations based on account balance"
      ]
    },
    {
      "id": "interest_increases_balance",
      "source": "interest_earned",
      "target": "bank_balance",
      "polarity": "positive",
      "label": "increases",
      "description": "Interest payments are deposited into the account, directly increasing the total balance available for future interest calculations",
      "strength": "strong",
      "delay": {
        "present": true,
        "duration": "1 month to 1 year",
        "description": "Interest is typically compounded and paid monthly, quarterly, or annually depending on account terms"
      },
      "evidence": [
        "Bank statements show interest deposits added to principal",
        "Compound interest formula demonstrates cumulative effect",
        "Account agreements specify interest compounding frequency"
      ]
    }
  ],
  "loops": [
    {
      "id": "compound_interest_loop",
      "type": "reinforcing",
      "path": ["bank_balance", "interest_earned", "bank_balance"],
      "label": "Compound Interest Growth Loop",
      "description": "Bank balance generates interest income, which is deposited back into the account, increasing the balance and creating more interest in subsequent periods",
      "behavior_pattern": "Exponential growth over time, with growth rate increasing as balance increases",
      "dominance_conditions": "Dominant when account remains untouched and interest rates are positive",
      "position": {"x": 300, "y": 100},
      "is_primary": true
    }
  ],
  "leverage_points": [
    {
      "id": "interest_rate_optimization",
      "target_type": "edge",
      "target_id": "balance_generates_interest",
      "leverage_level": 4,
      "title": "Optimize Interest Rate",
      "description": "Finding accounts with higher interest rates significantly amplifies the compounding effect",
      "intervention_strategies": [
        "Shop for high-yield savings accounts with better APY rates",
        "Consider certificates of deposit for higher rates with longer terms",
        "Monitor rate changes and switch accounts when beneficial"
      ],
      "expected_impact": "Dramatically increases long-term wealth accumulation through faster compounding",
      "difficulty": "low",
      "examples": [
        "Switching from 0.01% to 4% APY increases annual earnings 400-fold",
        "Online banks often offer higher rates than traditional banks"
      ]
    },
    {
      "id": "compounding_frequency",
      "target_type": "edge",
      "target_id": "interest_increases_balance",
      "leverage_level": 3,
      "title": "Maximize Compounding Frequency",
      "description": "More frequent compounding (daily vs. annually) increases the effective yield",
      "intervention_strategies": [
        "Choose accounts with daily compounding over monthly or annual",
        "Understand the difference between APR and APY",
        "Calculate effective annual rate for different compounding frequencies"
      ],
      "expected_impact": "Modest but measurable increase in total returns, especially with higher balances",
      "difficulty": "low",
      "examples": [
        "Daily compounding vs. annual can increase effective rate by 0.1-0.2%",
        "Effect becomes more significant with higher interest rates"
      ]
    },
    {
      "id": "initial_deposit_timing",
      "target_type": "node",
      "target_id": "bank_balance",
      "leverage_level": 2,
      "title": "Maximize Time in Market",
      "description": "Starting earlier and maintaining consistent deposits leverages the power of time in compound growth",
      "intervention_strategies": [
        "Start saving and earning interest as early as possible",
        "Set up automatic deposits to consistently grow the principal",
        "Avoid early withdrawals that interrupt compounding"
      ],
      "expected_impact": "Time is the most powerful factor in compound growth - starting 10 years earlier can double final results",
      "difficulty": "moderate",
      "examples": [
        "Starting at age 25 vs. 35 with same contributions can result in 50-100% more wealth at retirement",
        "Consistent $100/month deposits amplify compounding effects"
      ]
    }
  ],
  "scenarios": [
    {
      "id": "high_rate_environment",
      "title": "High Interest Rate Environment",
      "description": "Interest rates increase significantly (e.g., from 1% to 5% APY)",
      "changes": [
        {
          "target_type": "edge",
          "target_id": "balance_generates_interest",
          "change_description": "Interest generation rate increases 5x due to higher market rates"
        }
      ],
      "predicted_outcomes": "Dramatically accelerated balance growth, with compounding effects becoming much more visible in shorter time periods"
    },
    {
      "id": "regular_contributions",
      "title": "Add Regular Contributions",
      "description": "Account holder makes regular monthly deposits in addition to interest earnings",
      "changes": [
        {
          "target_type": "node",
          "target_id": "bank_balance",
          "change_description": "Balance increases by fixed amount monthly from external deposits"
        }
      ],
      "predicted_outcomes": "Combined effect of contributions plus compound interest creates accelerated wealth building"
    },
    {
      "id": "withdrawal_scenario",
      "title": "Regular Withdrawals",
      "description": "Account holder makes periodic withdrawals that reduce the balance",
      "changes": [
        {
          "target_type": "node",
          "target_id": "bank_balance",
          "change_description": "Balance decreases periodically due to withdrawals, reducing base for interest calculations"
        }
      ],
      "predicted_outcomes": "Reduced compounding effect as withdrawals lower the principal base; may even reverse growth if withdrawals exceed interest earnings"
    }
  ],
  "educational_content": {
    "discussion_questions": [
      "Why does compound interest create exponential rather than linear growth?",
      "How does the frequency of compounding affect total returns over time?",
      "What would happen to the growth pattern if you regularly withdrew the interest instead of leaving it in the account?",
      "How does starting to save 10 years earlier affect your final balance?",
      "Why is the interest rate such a powerful leverage point in this system?"
    ],
    "key_insights": [
      "Compound interest creates a reinforcing feedback loop where money makes money",
      "Small differences in interest rates compound dramatically over time",
      "Time is the most powerful factor in wealth accumulation through compound growth",
      "The system exhibits exponential rather than linear growth behavior",
      "Interrupting the compounding cycle (through withdrawals) significantly reduces long-term outcomes"
    ],
    "common_misconceptions": [
      {
        "misconception": "The difference between 2% and 4% interest is just 2% more money",
        "correction": "Over time, 4% compounds to nearly double the wealth of 2% due to the reinforcing feedback loop"
      },
      {
        "misconception": "Compound interest growth is linear - you earn the same amount each year",
        "correction": "Compound interest creates exponential growth where each year's earnings exceed the previous year's because interest earns interest"
      },
      {
        "misconception": "Starting to save 10 years later means 10 years less growth",
        "correction": "Due to exponential compounding, starting later often means 50-70% less final wealth, not just 10 years less"
      }
    ],
    "extension_activities": [
      "Calculate the difference in final balance between 1%, 3%, and 5% interest rates over 30 years",
      "Compare the effects of daily, monthly, and annual compounding on the same principal and rate",
      "Model what happens when you add regular monthly contributions to compound interest",
      "Explore how inflation affects the real purchasing power of compound interest growth"
    ],
    "related_concepts": [
      "Exponential Growth",
      "Reinforcing Feedback Loops",
      "Time Value of Money",
      "Present Value and Future Value",
      "Investment Growth Patterns"
    ]
  }
}